In [2]:
!pip install pandas -q

In [3]:
# how toread thse gudes in pandas 

import pandas as pd 
pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})

   A  B
0  1  4
1  2  5
2  3  6

In [5]:
# 10 minutes to pandas  

import pandas as pd 
import numpy as np

In [8]:
# Bascu data structure in pandas 
s = pd.Series([1, 3, 5, np.nan, 6, 8])
print(s)

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [11]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [21]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01 -0.532158 -2.482760 -0.033052  1.455492
2013-01-02 -0.448991  1.270714 -2.023630 -0.491081
2013-01-03  0.405522  1.054417  0.674148 -1.617779
2013-01-04 -0.818423 -0.686886  2.384287 -1.020148
2013-01-05  2.965971 -0.092929  0.235712  0.113914
2013-01-06  1.360489  0.384700  0.975840  0.748903

In [16]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [18]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [24]:
# Viewing data 

df.head()

                   A         B         C         D
2013-01-01 -0.532158 -2.482760 -0.033052  1.455492
2013-01-02 -0.448991  1.270714 -2.023630 -0.491081
2013-01-03  0.405522  1.054417  0.674148 -1.617779
2013-01-04 -0.818423 -0.686886  2.384287 -1.020148
2013-01-05  2.965971 -0.092929  0.235712  0.113914

In [26]:
df.tail(2)

                   A         B         C         D
2013-01-05  2.965971 -0.092929  0.235712  0.113914
2013-01-06  1.360489  0.384700  0.975840  0.748903

In [28]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [30]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [32]:
df.dtypes

A    float64
B    float64
C    float64
D    float64
dtype: object

In [35]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.488735 -0.092124  0.368884 -0.135116
std    1.451468  1.376091  1.444081  1.138580
min   -0.818423 -2.482760 -2.023630 -1.617779
25%   -0.511366 -0.538397  0.034139 -0.887881
50%   -0.021734  0.145886  0.454930 -0.188584
75%    1.121748  0.886988  0.900417  0.590156
max    2.965971  1.270714  2.384287  1.455492

In [36]:
df.head(1)

                   A        B         C         D
2013-01-01 -0.532158 -2.48276 -0.033052  1.455492

In [37]:
# Transposing your data 
df.transpose()

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.532158   -0.448991    0.405522   -0.818423    2.965971    1.360489
B   -2.482760    1.270714    1.054417   -0.686886   -0.092929    0.384700
C   -0.033052   -2.023630    0.674148    2.384287    0.235712    0.975840
D    1.455492   -0.491081   -1.617779   -1.020148    0.113914    0.748903

In [38]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  1.455492 -0.033052 -2.482760 -0.532158
2013-01-02 -0.491081 -2.023630  1.270714 -0.448991
2013-01-03 -1.617779  0.674148  1.054417  0.405522
2013-01-04 -1.020148  2.384287 -0.686886 -0.818423
2013-01-05  0.113914  0.235712 -0.092929  2.965971
2013-01-06  0.748903  0.975840  0.384700  1.360489

df.sort_values(by="B", ascending=False)

##  Selection 
- DataFrame.at()
- DataFrame.iat()
- DataFrame.loc()
- DataFrame.iloc()